Terraform Format and Style: success
Terraform Initialization: success
Terraform Validation: success
Terraform Plan: success

<details><summary>Show Plan</summary>

```

null_resource.prevent_destroy: Refreshing state... [id=1728082765789994772]
module.redis-v70.cloudfoundry_service_instance.redis: Refreshing state... [id=23aa4c64-a889-4b61-a4ca-4fe8dc8832e7]
module.logo_upload_bucket.cloudfoundry_service_instance.bucket: Refreshing state... [id=a93efd74-90dd-4816-b5d4-aa0a37071821]
module.api_network_route.cloudfoundry_network_policy.internal_route: Refreshing state... [id=69a1187c-5518-347e-270f-a89eb58d2a34]
module.ses_email.data.cloudfoundry_service.ses: Reading...
module.database.data.cloudfoundry_service.rds: Reading...
module.database.data.cloudfoundry_space.space: Reading...
module.sns_sms.data.cloudfoundry_space.space: Reading...
module.csv_upload_bucket.data.cloudfoundry_service.s3: Reading...
module.ses_email.data.cloudfoundry_space.space: Reading...
module.egress-space.data.cloudfoundry_org.org: Reading...
module.sns_sms.data.cloudfoundry_service.sns: Reading...
module.csv_upload_bucket.data.cloudfoundry_space.space: Reading...
module.ses_email.data.cloudfoundry_service.ses: Read complete after 0s [id=b41dc2f2-7825-4a8e-987a-ce87a161e670]
module.database.data.cloudfoundry_service.rds: Read complete after 0s [id=dcfb1d43-f22c-42d3-962c-7ae04eda24e7]
module.sns_sms.data.cloudfoundry_service.sns: Read complete after 0s [id=9c59e780-af5a-4a89-ac31-591a3ae1347e]
module.csv_upload_bucket.data.cloudfoundry_service.s3: Read complete after 0s [id=440ce9d9-b108-4bbe-80b4-08338f3cc25b]
module.egress-space.data.cloudfoundry_org.org: Read complete after 0s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.egress-space.data.cloudfoundry_user.users["dee18960-b0b1-462b-81f4-f570c7fbe7ef"]: Reading...
module.egress-space.data.cloudfoundry_user.users["carlo.costino@gsa.gov"]: Reading...
module.sns_sms.data.cloudfoundry_space.space: Read complete after 0s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.database.data.cloudfoundry_space.space: Read complete after 0s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.ses_email.data.cloudfoundry_space.space: Read complete after 0s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.csv_upload_bucket.data.cloudfoundry_space.space: Read complete after 0s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.egress-space.data.cloudfoundry_user.users["dee18960-b0b1-462b-81f4-f570c7fbe7ef"]: Read complete after 1s [id=8b349fbb-2879-4762-9fe7-1ee9a44123e5]
module.egress-space.data.cloudfoundry_user.users["carlo.costino@gsa.gov"]: Read complete after 1s [id=c7b9f5e0-4d1b-43b1-a659-e8fe4f7083a8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.api_network_route.cloudfoundry_network_policy.internal_route will be destroyed
  # (because cloudfoundry_network_policy.internal_route is not in configuration)
  - resource "cloudfoundry_network_policy" "internal_route" {
      - id = "69a1187c-5518-347e-270f-a89eb58d2a34" -> null

      - policy {
          - destination_app = "89c9b6a9-f030-4752-b30f-6b3193a25148" -> null
          - port            = "61443" -> null
          - protocol        = "tcp" -> null
          - source_app      = "5d983d08-5079-4159-8721-67edf948d345" -> null
        }
    }

  # module.csv_upload_bucket.cloudfoundry_service_instance.bucket will be created
  + resource "cloudfoundry_service_instance" "bucket" {
      + id                             = (known after apply)
      + name                           = "notify-api-csv-upload-bucket-staging"
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806"
      + space                          = "9745decb-4988-4bab-88a4-e3f07b36241c"
      + tags                           = []
    }

  # module.database.cloudfoundry_service_instance.rds will be created
  + resource "cloudfoundry_service_instance" "rds" {
      + id                             = (known after apply)
      + name                           = "notify-api-rds-staging"
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "903c65ce-6c2b-420f-ad7d-a94ac4d52e93"
      + space                          = "9745decb-4988-4bab-88a4-e3f07b36241c"
      + tags                           = []
    }

  # module.egress-space.cloudfoundry_space.public_egress will be created
  + resource "cloudfoundry_space" "public_egress" {
      + allow_ssh                = (known after apply)
      + auditors                 = (known after apply)
      + delete_recursive_allowed = true
      + developers               = (known after apply)
      + id                       = (known after apply)
      + managers                 = (known after apply)
      + name                     = "notify-staging-egress"
      + org                      = "9e428562-a2d9-41b4-9c23-1ef5237fb44e"
    }

  # module.egress-space.cloudfoundry_space_users.deployers will be created
  + resource "cloudfoundry_space_users" "deployers" {
      + auditors   = (known after apply)
      + developers = [
          + "8b349fbb-2879-4762-9fe7-1ee9a44123e5",
          + "c7b9f5e0-4d1b-43b1-a659-e8fe4f7083a8",
        ]
      + force      = false
      + id         = (known after apply)
      + managers   = [
          + "8b349fbb-2879-4762-9fe7-1ee9a44123e5",
          + "c7b9f5e0-4d1b-43b1-a659-e8fe4f7083a8",
        ]
      + space      = (known after apply)
    }

  # module.logo_upload_bucket.cloudfoundry_service_instance.bucket will be destroyed
  # (because cloudfoundry_service_instance.bucket is not in configuration)
  - resource "cloudfoundry_service_instance" "bucket" {
      - created_at        = "2025-10-22T18:34:55Z" -> null
      - id                = "a93efd74-90dd-4816-b5d4-aa0a37071821" -> null
      - last_operation    = {
          - created_at  = "2025-10-22T18:34:57Z" -> null
          - description = "" -> null
          - state       = "succeeded" -> null
          - type        = "create" -> null
          - updated_at  = "2025-10-22T18:34:57Z" -> null
        } -> null
      - maintenance_info  = {} -> null
      - name              = "notify-admin-logo-upload-bucket-staging" -> null
      - service_plan      = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806" -> null
      - space             = "9745decb-4988-4bab-88a4-e3f07b36241c" -> null
      - tags              = [
          - "terraform-cloudgov-managed",
        ] -> null
      - type              = "managed" -> null
      - updated_at        = "2025-10-22T18:34:57Z" -> null
      - upgrade_available = false -> null
    }

  # module.redis-v70.cloudfoundry_service_instance.redis will be destroyed
  # (because cloudfoundry_service_instance.redis is not in configuration)
  - resource "cloudfoundry_service_instance" "redis" {
      - created_at        = "2025-10-22T20:42:38Z" -> null
      - id                = "23aa4c64-a889-4b61-a4ca-4fe8dc8832e7" -> null
      - last_operation    = {
          - created_at  = "2025-10-22T20:51:44Z" -> null
          - description = "The service instance status is ready" -> null
          - state       = "succeeded" -> null
          - type        = "create" -> null
          - updated_at  = "2025-10-22T20:51:44Z" -> null
        } -> null
      - maintenance_info  = {} -> null
      - name              = "notify-admin-redis-v70-staging" -> null
      - parameters        = (sensitive value) -> null
      - service_plan      = "39e035d8-f847-4bf5-a2ee-521c3118cc42" -> null
      - space             = "9745decb-4988-4bab-88a4-e3f07b36241c" -> null
      - tags              = [
          - "terraform-cloudgov-managed",
        ] -> null
      - type              = "managed" -> null
      - updated_at        = "2025-10-22T20:42:40Z" -> null
      - upgrade_available = false -> null
    }

  # module.ses_email.cloudfoundry_service_instance.ses will be created
  + resource "cloudfoundry_service_instance" "ses" {
      + id                             = (known after apply)
      + json_params                    = jsonencode(
            {
              + domain                        = ""
              + email_receipt_error           = "notify-support@gsa.gov"
              + enable_feedback_notifications = true
              + mail_from_subdomain           = "mail"
              + region                        = "us-west-2"
            }
        )
      + name                           = "notify-api-ses-staging"
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "7630ae30-4883-4f84-b4c7-2779fdf6782f"
      + space                          = "9745decb-4988-4bab-88a4-e3f07b36241c"
    }

  # module.sns_sms.cloudfoundry_service_instance.sns will be created
  + resource "cloudfoundry_service_instance" "sns" {
      + id                             = (known after apply)
      + json_params                    = jsonencode(
            {
              + monthly_spend_limit = 25
              + region              = "us-west-2"
            }
        )
      + name                           = "notify-api-sns-staging"
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "9cfe0fad-3a46-42e9-a2ee-3f9bf1340816"
      + space                          = "9745decb-4988-4bab-88a4-e3f07b36241c"
    }

Plan: 6 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @terrazoon, Action: `pull_request`*